app/controllers/home_controller.rb

  def index
    @feed_entries = FeedEntry.all(:select => "title,author,url,published_at", :order => "published_at DESC").paginate(:per_page => 10, :page => params[:page])
---
SELECT title,author,url,published_at FROM `feed_entries` ORDER BY published_at DESC